// Написати ф-ю <strong>median</strong> яка приймає масив і знаходить
//               його медіану Медіана – це числове значення, яке ділить
//               відсортований масив чисел на більшу і меншу половини. У
//               відсортованому масиві з непарним числом елементів медіана – це
//               число в середині масиву. Для масиву з парним числом елементів, де
//               нема ні одного елемента точно посередині, медіана – це середнє
//               значення двох чисел, які знаходяться в середині масиву. В цій
//               задачі заданий непустий масив натуральних чисел. Вам потрібно
//               знайти медіану даного масиву.

function median(arr) {
  if (arr.length % 2) {
    return console.log(arr[Math.floor(arr.length / 2)]);
  } else {
    let mid = arr.length / 2;
    return console.log((arr[mid - 1] + arr[mid]) / 2);
  }
}

median([1, 2, 3, 4, 5]); // 3</code>
median([3, 6, 10, 15, 20, 99]); // 12.5</code>
